Revit 2027 API
FabricationRodInfo.IsRodLockedWithHost Method
 Checks if the rod is locked with the host. The method is applicable only for bearer hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRodLockedWithHost(
	int rodIndex
)
Public Function IsRodLockedWithHost (
	rodIndex As Integer
) As Boolean
public:
bool IsRodLockedWithHost(
	int rodIndex
)
member IsRodLockedWithHost :
        rodIndex : int -> bool
Parameters
rodIndex Int32
 The index of the rod.
Return Value
Boolean
 True if the rod is locked with its host.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
InvalidOperationException |  The hanger is not a bearer hanger.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace